
## Plan Result (prod)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 5 to add, 5 to change, 33 to destroy.</code></pre>

* Create
  * azurerm_key_vault_secret.flexible_secret_standard_format[&#34;DATABASE&#34;]
  * azurerm_key_vault_secret.flexible_secret_standard_format[&#34;HOST&#34;]
  * azurerm_key_vault_secret.flexible_secret_standard_format[&#34;PASS&#34;]
  * azurerm_key_vault_secret.flexible_secret_standard_format[&#34;PORT&#34;]
  * azurerm_key_vault_secret.flexible_secret_standard_format[&#34;USER&#34;]
* Update
  * azurerm_key_vault_secret.flexible_secret[&#34;DATABASE&#34;]
  * azurerm_key_vault_secret.flexible_secret[&#34;HOST&#34;]
  * azurerm_key_vault_secret.flexible_secret[&#34;PASS&#34;]
  * azurerm_key_vault_secret.flexible_secret[&#34;PORT&#34;]
  * azurerm_key_vault_secret.flexible_secret[&#34;USER&#34;]
* Delete
  * azurerm_key_vault_secret.POSTGRES-PASS
  * azurerm_key_vault_secret.POSTGRES-USER
  * azurerm_key_vault_secret.POSTGRES_DATABASE
  * azurerm_key_vault_secret.POSTGRES_HOST
  * azurerm_key_vault_secret.POSTGRES_PORT
  * azurerm_key_vault_secret.flyway_password
  * azurerm_key_vault_secret.staging_db_host
  * azurerm_key_vault_secret.staging_db_name
  * azurerm_key_vault_secret.staging_db_password
  * azurerm_key_vault_secret.staging_db_port
  * azurerm_key_vault_secret.staging_db_user
  * module.bulk-scan-db-v11.azurerm_postgresql_active_directory_administrator.admin
  * module.bulk-scan-db-v11.azurerm_postgresql_database.postgres-db
  * module.bulk-scan-db-v11.azurerm_postgresql_server.postgres-paas
  * module.bulk-scan-db-v11.azurerm_private_endpoint.postgres[0]
  * module.bulk-scan-db-v11.azurerm_resource_group.data-resourcegroup
  * module.bulk-scan-db-v11.null_resource.set-user-permissions[0]
  * module.bulk-scan-db-v11.random_password.password
  * module.bulk-scan-staging-db.azurerm_postgresql_active_directory_administrator.admin
  * module.bulk-scan-staging-db.azurerm_resource_group.data-resourcegroup
  * module.bulk-scan-staging-db.azurerm_template_deployment.postgres-paas
  * module.bulk-scan-staging-db.null_resource.set-user-permissions[0]
  * module.bulk-scan-staging-db.null_resource.subnet_mappings[0]
  * module.bulk-scan-staging-db.null_resource.subnet_mappings[1]
  * module.bulk-scan-staging-db.null_resource.subnet_mappings[2]
  * module.bulk-scan-staging-db.null_resource.subnet_mappings[3]
  * module.bulk-scan-staging-db.null_resource.subnet_mappings[4]
  * module.bulk-scan-staging-db.null_resource.subnet_mappings[5]
  * module.bulk-scan-staging-db.null_resource.subnet_mappings[6]
  * module.bulk-scan-staging-db.null_resource.subnet_mappings[7]
  * module.bulk-scan-staging-db.null_resource.subnet_mappings[8]
  * module.bulk-scan-staging-db.null_resource.subnet_mappings[9]
  * module.bulk-scan-staging-db.random_string.password


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.POSTGRES-PASS will be destroyed
  # (because azurerm_key_vault_secret.POSTGRES-PASS is not in configuration)
  - resource "azurerm_key_vault_secret" "POSTGRES-PASS" {
      - id                      = "https://bulk-scan-prod.vault.azure.net/secrets/processor-POSTGRES-PASS/371bbbd5bec54d38b9e36ee8eebf94a5" -> null
      - key_vault_id            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/bulk-scan-prod/providers/Microsoft.KeyVault/vaults/bulk-scan-prod" -> null
      - name                    = "processor-POSTGRES-PASS" -> null
      - resource_id             = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/bulk-scan-prod/providers/Microsoft.KeyVault/vaults/bulk-scan-prod/secrets/processor-POSTGRES-PASS/versions/371bbbd5bec54d38b9e36ee8eebf94a5" -> null
      - resource_versionless_id = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/bulk-scan-prod/providers/Microsoft.KeyVault/vaults/bulk-scan-prod/secrets/processor-POSTGRES-PASS" -> null
      - tags                    = {} -> null
      - value                   = (sensitive value) -> null
      - version                 = "371bbbd5bec54d38b9e36ee8eebf94a5" -> null
      - versionless_id          = "https://bulk-scan-prod.vault.azure.net/secrets/processor-POSTGRES-PASS" -> null
    }

  # azurerm_key_vault_secret.POSTGRES-USER will be destroyed
  # (because azurerm_key_vault_secret.POSTGRES-USER is not in configuration)
  - resource "azurerm_key_vault_secret" "POSTGRES-USER" {
      - id                      = "https://bulk-scan-prod.vault.azure.net/secrets/processor-POSTGRES-USER/5fc56c67dab140499ea623487d26adcc" -> null
      - key_vault_id            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/bulk-scan-prod/providers/Microsoft.KeyVault/vaults/bulk-scan-prod" -> null
      - name                    = "processor-POSTGRES-USER" -> null
      - resource_id             = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/bulk-scan-prod/providers/Microsoft.KeyVault/vaults/bulk-scan-prod/secrets/processor-POSTGRES-USER/versions/5fc56c67dab140499ea623487d26adcc" -> null
      - resource_versionless_id = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/bulk-scan-prod/providers/Microsoft.KeyVault/vaults/bulk-scan-prod/secrets/processor-POSTGRES-USER" -> null
      - tags                    = {} -> null
      - value                   = (sensitive value) -> null
      - version                 = "5fc56c67dab140499ea623487d26adcc" -> null
      - versionless_id          = "https://bulk-scan-prod.vault.azure.net/secrets/processor-POSTGRES-USER" -> null
    }

  # azurerm_key_vault_secret.POSTGRES_DATABASE will be destroyed
  # (because azurerm_key_vault_secret.POSTGRES_DATABASE is not in configuration)
  - resource "azurerm_key_vault_secret" "POSTGRES_DATABASE" {
      - id                      = "https://bulk-scan-prod.vault.azure.net/secrets/processor-POSTGRES-DATABASE/4ab2f9ce63484f1db3f942672acd3583" -> null
      - key_vault_id            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/bulk-scan-prod/providers/Microsoft.KeyVault/vaults/bulk-scan-prod" -> null
      - name                    = "processor-POSTGRES-DATABASE" -> null
      - resource_id             = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/bulk-scan-prod/providers/Microsoft.KeyVault/vaults/bulk-scan-prod/secrets/processor-POSTGRES-DATABASE/versions/4ab2f9ce63484f1db3f942672acd3583" -> null
      - resource_versionless_id = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/bulk-scan-prod/providers/Microsoft.KeyVault/vaults/bulk-scan-prod/secrets/processor-POSTGRES-DATABASE" -> null
      - tags                    = {} -> null
      - value                   = (sensitive value) -> null
      - version                 = "4ab2f9ce63484f1db3f942672acd3583" -> null
      - versionless_id          = "https://bulk-scan-prod.vault.azure.net/secrets/processor-POSTGRES-DATABASE" -> null
    }

  # azurerm_key_vault_secret.POSTGRES_HOST will be destroyed
  # (because azurerm_key_vault_secret.POSTGRES_HOST is not in configuration)
  - resource "azurerm_key_vault_secret" "POSTGRES_HOST" {
      - id                      = "https://bulk-scan-prod.vault.azure.net/secrets/processor-POSTGRES-HOST/e1a6bdc4fc5142029a7b79fa7aadad2f" -> null
      - key_vault_id            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/bulk-scan-prod/providers/Microsoft.KeyVault/vaults/bulk-scan-prod" -> null
      - name                    = "processor-POSTGRES-HOST" -> null
      - resource_id             = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/bulk-scan-prod/providers/Microsoft.KeyVault/vaults/bulk-scan-prod/secrets/processor-POSTGRES-HOST/versions/e1a6bdc4fc5142029a7b79fa7aadad2f" -> null
      - resource_versionless_id = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/bulk-scan-prod/providers/Microsoft.KeyVault/vaults/bulk-scan-prod/secrets/processor-POSTGRES-HOST" -> null
      - tags                    = {} -> null
      - value                   = (sensitive value) -> null
      - version                 = "e1a6bdc4fc5142029a7b79fa7aadad2f" -> null
      - versionless_id          = "https://bulk-scan-prod.vault.azure.net/secrets/processor-POSTGRES-HOST" -> null
    }

  # azurerm_key_vault_secret.POSTGRES_PORT will be destroyed
  # (because azurerm_key_vault_secret.POSTGRES_PORT is not in configuration)
  - resource "azurerm_key_vault_secret" "POSTGRES_PORT" {
      - id                      = "https://bulk-scan-prod.vault.azure.net/secrets/processor-POSTGRES-PORT/daffe8981d184888a037995b4030ba17" -> null
      - key_vault_id            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/bulk-scan-prod/providers/Microsoft.KeyVault/vaults/bulk-scan-prod" -> null
      - name                    = "processor-POSTGRES-PORT" -> null
      - resource_id             = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/bulk-scan-prod/providers/Microsoft.KeyVault/vaults/bulk-scan-prod/secrets/processor-POSTGRES-PORT/versions/daffe8981d184888a037995b4030ba17" -> null
      - resource_versionless_id = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/bulk-scan-prod/providers/Microsoft.KeyVault/vaults/bulk-scan-prod/secrets/processor-POSTGRES-PORT" -> null
      - tags                    = {} -> null
      - value                   = (sensitive value) -> null
      - version                 = "daffe8981d184888a037995b4030ba17" -> null
      - versionless_id          = "https://bulk-scan-prod.vault.azure.net/secrets/processor-POSTGRES-PORT" -> null
    }

  # azurerm_key_vault_secret.flexible_secret["DATABASE"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "flexible_secret" {
      ~ expiration_date         = "2026-04-05T14:11:12Z" -> (known after apply)
        id                      = "https://bulk-scan-prod.vault.azure.net/secrets/processor-POSTGRES-FLEXIBLE-DATABASE/424cc88f30194bd7b74b5be12e9a901d"
        name                    = "processor-POSTGRES-FLEXIBLE-DATABASE"
        tags                    = {
            "application"         = "bulk-scan-print"
            "builtFrom"           = "https://github.com/HMCTS/bulk-scan-processor.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#rbs"
            "environment"         = "production"
            "managedBy"           = "Bulk Scanning and Printing"
            "source"              = "processor PostgreSQL"
        }
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.flexible_secret["HOST"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "flexible_secret" {
      ~ expiration_date         = "2026-04-05T14:11:12Z" -> (known after apply)
        id                      = "https://bulk-scan-prod.vault.azure.net/secrets/processor-POSTGRES-FLEXIBLE-HOST/0686b275c4f042e0b5ec32e216eb7227"
        name                    = "processor-POSTGRES-FLEXIBLE-HOST"
        tags                    = {
            "application"         = "bulk-scan-print"
            "builtFrom"           = "https://github.com/HMCTS/bulk-scan-processor.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#rbs"
            "environment"         = "production"
            "managedBy"           = "Bulk Scanning and Printing"
            "source"              = "processor PostgreSQL"
        }
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.flexible_secret["PASS"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "flexible_secret" {
      ~ expiration_date         = "2026-04-05T14:11:12Z" -> (known after apply)
        id                      = "https://bulk-scan-prod.vault.azure.net/secrets/processor-POSTGRES-FLEXIBLE-PASS/a6d2d7e1e150499da3d23fc33a0f9ba7"
        name                    = "processor-POSTGRES-FLEXIBLE-PASS"
        tags                    = {
            "application"         = "bulk-scan-print"
            "builtFrom"           = "https://github.com/HMCTS/bulk-scan-processor.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#rbs"
            "environment"         = "production"
            "managedBy"           = "Bulk Scanning and Printing"
            "source"              = "processor PostgreSQL"
        }
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.flexible_secret["PORT"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "flexible_secret" {
      ~ expiration_date         = "2026-04-05T14:11:12Z" -> (known after apply)
        id                      = "https://bulk-scan-prod.vault.azure.net/secrets/processor-POSTGRES-FLEXIBLE-PORT/4d7e658ea8d74a9fbbd1afaf31d0b302"
        name                    = "processor-POSTGRES-FLEXIBLE-PORT"
        tags                    = {
            "application"         = "bulk-scan-print"
            "builtFrom"           = "https://github.com/HMCTS/bulk-scan-processor.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#rbs"
            "environment"         = "production"
            "managedBy"           = "Bulk Scanning and Printing"
            "source"              = "processor PostgreSQL"
        }
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.flexible_secret["USER"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "flexible_secret" {
      ~ expiration_date         = "2026-04-05T14:11:12Z" -> (known after apply)
        id                      = "https://bulk-scan-prod.vault.azure.net/secrets/processor-POSTGRES-FLEXIBLE-USER/d6b4b24713bb4247834d3f3f870da011"
        name                    = "processor-POSTGRES-FLEXIBLE-USER"
        tags                    = {
            "application"         = "bulk-scan-print"
            "builtFrom"           = "https://github.com/HMCTS/bulk-scan-processor.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#rbs"
            "environment"         = "production"
            "managedBy"           = "Bulk Scanning and Printing"
            "source"              = "processor PostgreSQL"
        }
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.flexible_secret_standard_format["DATABASE"] will be created
  + resource "azurerm_key_vault_secret" "flexible_secret_standard_format" {
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/bulk-scan-prod/providers/Microsoft.KeyVault/vaults/bulk-scan-prod"
      + name                    = "processor-POSTGRES-DATABASE"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = {
          + "application"         = "bulk-scan-print"
          + "builtFrom"           = "https://github.com/HMCTS/bulk-scan-processor.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#rbs"
          + "environment"         = "production"
          + "managedBy"           = "Bulk Scanning and Printing"
          + "source"              = "processor PostgreSQL"
        }
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.flexible_secret_standard_format["HOST"] will be created
  + resource "azurerm_key_vault_secret" "flexible_secret_standard_format" {
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/bulk-scan-prod/providers/Microsoft.KeyVault/vaults/bulk-scan-prod"
      + name                    = "processor-POSTGRES-HOST"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = {
          + "application"         = "bulk-scan-print"
          + "builtFrom"           = "https://github.com/HMCTS/bulk-scan-processor.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#rbs"
          + "environment"         = "production"
          + "managedBy"           = "Bulk Scanning and Printing"
          + "source"              = "processor PostgreSQL"
        }
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.flexible_secret_standard_format["PASS"] will be created
  + resource "azurerm_key_vault_secret" "flexible_secret_standard_format" {
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/bulk-scan-prod/providers/Microsoft.KeyVault/vaults/bulk-scan-prod"
      + name                    = "processor-POSTGRES-PASS"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = {
          + "application"         = "bulk-scan-print"
          + "builtFrom"           = "https://github.com/HMCTS/bulk-scan-processor.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#rbs"
          + "environment"         = "production"
          + "managedBy"           = "Bulk Scanning and Printing"
          + "source"              = "processor PostgreSQL"
        }
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.flexible_secret_standard_format["PORT"] will be created
  + resource "azurerm_key_vault_secret" "flexible_secret_standard_format" {
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/bulk-scan-prod/providers/Microsoft.KeyVault/vaults/bulk-scan-prod"
      + name                    = "processor-POSTGRES-PORT"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = {
          + "application"         = "bulk-scan-print"
          + "builtFrom"           = "https://github.com/HMCTS/bulk-scan-processor.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#rbs"
          + "environment"         = "production"
          + "managedBy"           = "Bulk Scanning and Printing"
          + "source"              = "processor PostgreSQL"
        }
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.flexible_secret_standard_format["USER"] will be created
  + resource "azurerm_key_vault_secret" "flexible_secret_standard_format" {
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/bulk-scan-prod/providers/Microsoft.KeyVault/vaults/bulk-scan-prod"
      + name                    = "processor-POSTGRES-USER"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = {
          + "application"         = "bulk-scan-print"
          + "builtFrom"           = "https://github.com/HMCTS/bulk-scan-processor.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#rbs"
          + "environment"         = "production"
          + "managedBy"           = "Bulk Scanning and Printing"
          + "source"              = "processor PostgreSQL"
        }
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.flyway_password will be destroyed
  # (because azurerm_key_vault_secret.flyway_password is not in configuration)
  - resource "azurerm_key_vault_secret" "flyway_password" {
      - id                      = "https://bulk-scan-prod.vault.azure.net/secrets/flyway-password/dabcbc34d7ec428898a453ebd0f8d5c9" -> null
      - key_vault_id            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/bulk-scan-prod/providers/Microsoft.KeyVault/vaults/bulk-scan-prod" -> null
      - name                    = "flyway-password" -> null
      - resource_id             = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/bulk-scan-prod/providers/Microsoft.KeyVault/vaults/bulk-scan-prod/secrets/flyway-password/versions/dabcbc34d7ec428898a453ebd0f8d5c9" -> null
      - resource_versionless_id = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/bulk-scan-prod/providers/Microsoft.KeyVault/vaults/bulk-scan-prod/secrets/flyway-password" -> null
      - tags                    = {} -> null
      - value                   = (sensitive value) -> null
      - version                 = "dabcbc34d7ec428898a453ebd0f8d5c9" -> null
      - versionless_id          = "https://bulk-scan-prod.vault.azure.net/secrets/flyway-password" -> null
    }

  # azurerm_key_vault_secret.staging_db_host will be destroyed
  # (because azurerm_key_vault_secret.staging_db_host is not in configuration)
  - resource "azurerm_key_vault_secret" "staging_db_host" {
      - id                      = "https://bulk-scan-prod.vault.azure.net/secrets/processor-staging-db-host/872a9367cf3e4012bc77bc4b810a6d91" -> null
      - key_vault_id            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/bulk-scan-prod/providers/Microsoft.KeyVault/vaults/bulk-scan-prod" -> null
      - name                    = "processor-staging-db-host" -> null
      - resource_id             = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/bulk-scan-prod/providers/Microsoft.KeyVault/vaults/bulk-scan-prod/secrets/processor-staging-db-host/versions/872a9367cf3e4012bc77bc4b810a6d91" -> null
      - resource_versionless_id = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/bulk-scan-prod/providers/Microsoft.KeyVault/vaults/bulk-scan-prod/secrets/processor-staging-db-host" -> null
      - tags                    = {} -> null
      - value                   = (sensitive value) -> null
      - version                 = "872a9367cf3e4012bc77bc4b810a6d91" -> null
      - versionless_id          = "https://bulk-scan-prod.vault.azure.net/secrets/processor-staging-db-host" -> null
    }

  # azurerm_key_vault_secret.staging_db_name will be destroyed
  # (because azurerm_key_vault_secret.staging_db_name is not in configuration)
  - resource "azurerm_key_vault_secret" "staging_db_name" {
      - id                      = "https://bulk-scan-prod.vault.azure.net/secrets/processor-staging-db-name/621d7dc08e08423abc3b57fd523e9065" -> null
      - key_vault_id            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/bulk-scan-prod/providers/Microsoft.KeyVault/vaults/bulk-scan-prod" -> null
      - name                    = "processor-staging-db-name" -> null
      - resource_id             = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/bulk-scan-prod/providers/Microsoft.KeyVault/vaults/bulk-scan-prod/secrets/processor-staging-db-name/versions/621d7dc08e08423abc3b57fd523e9065" -> null
      - resource_versionless_id = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/bulk-scan-prod/providers/Microsoft.KeyVault/vaults/bulk-scan-prod/secrets/processor-staging-db-name" -> null
      - tags                    = {} -> null
      - value                   = (sensitive value) -> null
      - version                 = "621d7dc08e08423abc3b57fd523e9065" -> null
      - versionless_id          = "https://bulk-scan-prod.vault.azure.net/secrets/processor-staging-db-name" -> null
    }

  # azurerm_key_vault_secret.staging_db_password will be destroyed
  # (because azurerm_key_vault_secret.staging_db_password is not in configuration)
  - resource "azurerm_key_vault_secret" "staging_db_password" {
      - id                      = "https://bulk-scan-prod.vault.azure.net/secrets/processor-staging-db-password/1a800d0982334d2082e3581772291af5" -> null
      - key_vault_id            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/bulk-scan-prod/providers/Microsoft.KeyVault/vaults/bulk-scan-prod" -> null
      - name                    = "processor-staging-db-password" -> null
      - resource_id             = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/bulk-scan-prod/providers/Microsoft.KeyVault/vaults/bulk-scan-prod/secrets/processor-staging-db-password/versions/1a800d0982334d2082e3581772291af5" -> null
      - resource_versionless_id = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/bulk-scan-prod/providers/Microsoft.KeyVault/vaults/bulk-scan-prod/secrets/processor-staging-db-password" -> null
      - tags                    = {} -> null
      - value                   = (sensitive value) -> null
      - version                 = "1a800d0982334d2082e3581772291af5" -> null
      - versionless_id          = "https://bulk-scan-prod.vault.azure.net/secrets/processor-staging-db-password" -> null
    }

  # azurerm_key_vault_secret.staging_db_port will be destroyed
  # (because azurerm_key_vault_secret.staging_db_port is not in configuration)
  - resource "azurerm_key_vault_secret" "staging_db_port" {
      - id                      = "https://bulk-scan-prod.vault.azure.net/secrets/processor-staging-db-port/a057a6e0611d4bd3b9b775960f5b70fc" -> null
      - key_vault_id            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/bulk-scan-prod/providers/Microsoft.KeyVault/vaults/bulk-scan-prod" -> null
      - name                    = "processor-staging-db-port" -> null
      - resource_id             = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/bulk-scan-prod/providers/Microsoft.KeyVault/vaults/bulk-scan-prod/secrets/processor-staging-db-port/versions/a057a6e0611d4bd3b9b775960f5b70fc" -> null
      - resource_versionless_id = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/bulk-scan-prod/providers/Microsoft.KeyVault/vaults/bulk-scan-prod/secrets/processor-staging-db-port" -> null
      - tags                    = {} -> null
      - value                   = (sensitive value) -> null
      - version                 = "a057a6e0611d4bd3b9b775960f5b70fc" -> null
      - versionless_id          = "https://bulk-scan-prod.vault.azure.net/secrets/processor-staging-db-port" -> null
    }

  # azurerm_key_vault_secret.staging_db_user will be destroyed
  # (because azurerm_key_vault_secret.staging_db_user is not in configuration)
  - resource "azurerm_key_vault_secret" "staging_db_user" {
      - id                      = "https://bulk-scan-prod.vault.azure.net/secrets/processor-staging-db-user/0da0935712654db693bf73126b373316" -> null
      - key_vault_id            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/bulk-scan-prod/providers/Microsoft.KeyVault/vaults/bulk-scan-prod" -> null
      - name                    = "processor-staging-db-user" -> null
      - resource_id             = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/bulk-scan-prod/providers/Microsoft.KeyVault/vaults/bulk-scan-prod/secrets/processor-staging-db-user/versions/0da0935712654db693bf73126b373316" -> null
      - resource_versionless_id = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/bulk-scan-prod/providers/Microsoft.KeyVault/vaults/bulk-scan-prod/secrets/processor-staging-db-user" -> null
      - tags                    = {} -> null
      - value                   = (sensitive value) -> null
      - version                 = "0da0935712654db693bf73126b373316" -> null
      - versionless_id          = "https://bulk-scan-prod.vault.azure.net/secrets/processor-staging-db-user" -> null
    }

  # module.bulk-scan-db-v11.azurerm_postgresql_active_directory_administrator.admin will be destroyed
  # (because azurerm_postgresql_active_directory_administrator.admin is not in configuration)
  - resource "azurerm_postgresql_active_directory_administrator" "admin" {
      - id                  = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/bulk-scan-processor-postgres-db-v11-data-prod/providers/Microsoft.DBforPostgreSQL/servers/bulk-scan-processor-postgres-db-v11-prod" -> null
      - login               = "DTS Platform Operations SC" -> null
      - object_id           = "4d0554dd-fe60-424a-be9c-36636826d927" -> null
      - resource_group_name = "bulk-scan-processor-postgres-db-v11-data-prod" -> null
      - server_name         = "bulk-scan-processor-postgres-db-v11-prod" -> null
      - tenant_id           = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> null
    }

  # module.bulk-scan-db-v11.azurerm_postgresql_database.postgres-db will be destroyed
  # (because azurerm_postgresql_database.postgres-db is not in configuration)
  - resource "azurerm_postgresql_database" "postgres-db" {
      - charset             = "UTF8" -> null
      - collation           = "en-GB" -> null
      - id                  = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/bulk-scan-processor-postgres-db-v11-data-prod/providers/Microsoft.DBforPostgreSQL/servers/bulk-scan-processor-postgres-db-v11-prod/databases/bulk_scan" -> null
      - name                = "bulk_scan" -> null
      - resource_group_name = "bulk-scan-processor-postgres-db-v11-data-prod" -> null
      - server_name         = "bulk-scan-processor-postgres-db-v11-prod" -> null
    }

  # module.bulk-scan-db-v11.azurerm_postgresql_server.postgres-paas will be destroyed
  # (because azurerm_postgresql_server.postgres-paas is not in configuration)
  - resource "azurerm_postgresql_server" "postgres-paas" {
      - administrator_login               = "bulk_scanner" -> null
      - administrator_login_password      = (sensitive value) -> null
      - auto_grow_enabled                 = true -> null
      - backup_retention_days             = 35 -> null
      - create_mode                       = "Default" -> null
      - fqdn                              = "bulk-scan-processor-postgres-db-v11-prod.postgres.database.azure.com" -> null
      - geo_redundant_backup_enabled      = true -> null
      - id                                = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/bulk-scan-processor-postgres-db-v11-data-prod/providers/Microsoft.DBforPostgreSQL/servers/bulk-scan-processor-postgres-db-v11-prod" -> null
      - infrastructure_encryption_enabled = false -> null
      - location                          = "uksouth" -> null
      - name                              = "bulk-scan-processor-postgres-db-v11-prod" -> null
      - public_network_access_enabled     = false -> null
      - resource_group_name               = "bulk-scan-processor-postgres-db-v11-data-prod" -> null
      - sku_name                          = "GP_Gen5_2" -> null
      - ssl_enforcement_enabled           = true -> null
      - ssl_minimal_tls_version_enforced  = "TLS1_2" -> null
      - storage_mb                        = 51200 -> null
      - tags                              = {
          - "application"         = "bulk-scan-print"
          - "builtFrom"           = "https://github.com/HMCTS/bulk-scan-processor.git"
          - "businessArea"        = "CFT"
          - "contactSlackChannel" = "#rbs"
          - "environment"         = "production"
          - "managedBy"           = "Bulk Scanning and Printing"
        } -> null
      - version                           = "11" -> null
    }

  # module.bulk-scan-db-v11.azurerm_private_endpoint.postgres[0] will be destroyed
  # (because azurerm_private_endpoint.postgres is not in configuration)
  - resource "azurerm_private_endpoint" "postgres" {
      - custom_dns_configs       = [] -> null
      - id                       = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/bulk-scan-processor-postgres-db-v11-data-prod/providers/Microsoft.Network/privateEndpoints/bulk-scan-prod-endpoint" -> null
      - location                 = "uksouth" -> null
      - name                     = "bulk-scan-prod-endpoint" -> null
      - network_interface        = [
          - {
              - id   = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/bulk-scan-processor-postgres-db-v11-data-prod/providers/Microsoft.Network/networkInterfaces/bulk-scan-prod-endpoint.nic.f6451e99-356e-4bb6-ba01-9d0ef600be18"
              - name = "bulk-scan-prod-endpoint.nic.f6451e99-356e-4bb6-ba01-9d0ef600be18"
            },
        ] -> null
      - private_dns_zone_configs = [
          - {
              - id                  = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/bulk-scan-processor-postgres-db-v11-data-prod/providers/Microsoft.Network/privateEndpoints/bulk-scan-prod-endpoint/privateDnsZoneGroups/postgres-endpoint-dnszonegroup/privateDnsZoneConfigs/privatelink.postgres.database.azure.com"
              - name                = "privatelink.postgres.database.azure.com"
              - private_dns_zone_id = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.postgres.database.azure.com"
              - record_sets         = [
                  - {
                      - fqdn         = "bulk-scan-processor-postgres-db-v11-prod.privatelink.postgres.database.azure.com"
                      - ip_addresses = [
                          - "10.96.64.10",
                        ]
                      - name         = "bulk-scan-processor-postgres-db-v11-prod"
                      - ttl          = 10
                      - type         = "A"
                    },
                ]
            },
        ] -> null
      - resource_group_name      = "bulk-scan-processor-postgres-db-v11-data-prod" -> null
      - subnet_id                = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/core-infra-prod/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-prod/subnets/core-infra-subnet-0-prod" -> null
      - tags                     = {
          - "application"         = "bulk-scan-print"
          - "builtFrom"           = "https://github.com/HMCTS/bulk-scan-processor.git"
          - "businessArea"        = "CFT"
          - "contactSlackChannel" = "#rbs"
          - "environment"         = "production"
          - "managedBy"           = "Bulk Scanning and Printing"
        } -> null

      - private_dns_zone_group {
          - id                   = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/bulk-scan-processor-postgres-db-v11-data-prod/providers/Microsoft.Network/privateEndpoints/bulk-scan-prod-endpoint/privateDnsZoneGroups/postgres-endpoint-dnszonegroup" -> null
          - name                 = "postgres-endpoint-dnszonegroup" -> null
          - private_dns_zone_ids = [
              - "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.postgres.database.azure.com",
            ] -> null
        }

      - private_service_connection {
          - is_manual_connection           = false -> null
          - name                           = "bulk-scan-prod-db" -> null
          - private_connection_resource_id = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/bulk-scan-processor-postgres-db-v11-data-prod/providers/Microsoft.DBforPostgreSQL/servers/bulk-scan-processor-postgres-db-v11-prod" -> null
          - private_ip_address             = "10.96.64.10" -> null
          - subresource_names              = [
              - "postgresqlServer",
            ] -> null
        }
    }

  # module.bulk-scan-db-v11.azurerm_resource_group.data-resourcegroup will be destroyed
  # (because azurerm_resource_group.data-resourcegroup is not in configuration)
  - resource "azurerm_resource_group" "data-resourcegroup" {
      - id       = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/bulk-scan-processor-postgres-db-v11-data-prod" -> null
      - location = "uksouth" -> null
      - name     = "bulk-scan-processor-postgres-db-v11-data-prod" -> null
      - tags     = {
          - "application"         = "bulk-scan-print"
          - "builtFrom"           = "https://github.com/HMCTS/bulk-scan-processor.git"
          - "businessArea"        = "CFT"
          - "contactSlackChannel" = "#rbs"
          - "environment"         = "production"
          - "managedBy"           = "Bulk Scanning and Printing"
        } -> null
    }

  # module.bulk-scan-db-v11.null_resource.set-user-permissions[0] will be destroyed
  # (because null_resource.set-user-permissions is not in configuration)
  - resource "null_resource" "set-user-permissions" {
      - id       = "3305030075437464913" -> null
      - triggers = {
          - "db_reader_user" = "DTS JIT Access bulk-scan DB Reader SC"
          - "name"           = "bulk-scan-processor-postgres-db-v11"
          - "script_hash"    = "f6e30acec7d742bb8de09d51ea3724cedb22a597c641336ed4f8aecd58283229"
        } -> null
    }

  # module.bulk-scan-db-v11.random_password.password will be destroyed
  # (because random_password.password is not in configuration)
  - resource "random_password" "password" {
      - bcrypt_hash = (sensitive value) -> null
      - id          = "none" -> null
      - length      = 16 -> null
      - lower       = true -> null
      - min_lower   = 0 -> null
      - min_numeric = 0 -> null
      - min_special = 0 -> null
      - min_upper   = 0 -> null
      - number      = true -> null
      - numeric     = true -> null
      - result      = (sensitive value) -> null
      - special     = true -> null
      - upper       = true -> null
    }

  # module.bulk-scan-staging-db.azurerm_postgresql_active_directory_administrator.admin will be destroyed
  # (because azurerm_postgresql_active_directory_administrator.admin is not in configuration)
  - resource "azurerm_postgresql_active_directory_administrator" "admin" {
      - id                  = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/bulk-scan-processor-staging-data-prod/providers/Microsoft.DBforPostgreSQL/servers/bulk-scan-processor-staging-prod" -> null
      - login               = "DTS Platform Operations SC" -> null
      - object_id           = "4d0554dd-fe60-424a-be9c-36636826d927" -> null
      - resource_group_name = "bulk-scan-processor-staging-data-prod" -> null
      - server_name         = "bulk-scan-processor-staging-prod" -> null
      - tenant_id           = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> null
    }

  # module.bulk-scan-staging-db.azurerm_resource_group.data-resourcegroup will be destroyed
  # (because azurerm_resource_group.data-resourcegroup is not in configuration)
  - resource "azurerm_resource_group" "data-resourcegroup" {
      - id       = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/bulk-scan-processor-staging-data-prod" -> null
      - location = "uksouth" -> null
      - name     = "bulk-scan-processor-staging-data-prod" -> null
      - tags     = {
          - "application"         = "bulk-scan-print"
          - "builtFrom"           = "https://github.com/HMCTS/bulk-scan-processor.git"
          - "businessArea"        = "CFT"
          - "contactSlackChannel" = "#rbs"
          - "environment"         = "production"
          - "managedBy"           = "Bulk Scanning and Printing"
        } -> null
    }

  # module.bulk-scan-staging-db.azurerm_template_deployment.postgres-paas will be destroyed
  # (because azurerm_template_deployment.postgres-paas is not in configuration)
  - resource "azurerm_template_deployment" "postgres-paas" {
      - deployment_mode     = "Incremental" -> null
      - id                  = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/bulk-scan-processor-staging-data-prod/providers/Microsoft.Resources/deployments/bulk-scan-processor-staging-prod" -> null
      - name                = "bulk-scan-processor-staging-prod" -> null
      - outputs             = {} -> null
      - parameters          = {
          - "administratorLogin"         = "bulk_scanner"
          - "administratorLoginPassword" = "i2x8BL<@EW5g#V56"
          - "backupRetentionDays"        = "35"
          - "charset"                    = "utf8"
          - "collation"                  = "en-GB"
          - "commonTags"                 = "eyJhcHBsaWNhdGlvbiI6ImJ1bGstc2Nhbi1wcmludCIsImJ1aWx0RnJvbSI6Imh0dHBzOi8vZ2l0aHViLmNvbS9ITUNUUy9idWxrLXNjYW4tcHJvY2Vzc29yLmdpdCIsImJ1c2luZXNzQXJlYSI6IkNGVCIsImNvbnRhY3RTbGFja0NoYW5uZWwiOiIjcmJzIiwiZW52aXJvbm1lbnQiOiJwcm9kdWN0aW9uIiwibWFuYWdlZEJ5IjoiQnVsayBTY2FubmluZyBhbmQgUHJpbnRpbmcifQ=="
          - "dbName"                     = "bulk_scan"
          - "dbRules"                    = "W3sicnVsZV9uYW1lIjoiYXNlIiwic3VibmV0X2lkIjoiL3N1YnNjcmlwdGlvbnMvODk5OWRlYzMtMDEwNC00YTI3LTk0ZWUtNjU4ODU1OTcyOWQxL3Jlc291cmNlR3JvdXBzL2NvcmUtaW5mcmEtcHJvZC9wcm92aWRlcnMvTWljcm9zb2Z0Lk5ldHdvcmsvdmlydHVhbE5ldHdvcmtzL2NvcmUtaW5mcmEtdm5ldC1wcm9kL3N1Ym5ldHMvY29yZS1pbmZyYS1zdWJuZXQtMy1wcm9kIn0seyJydWxlX25hbWUiOiJjZnQtdGYtYWtzMDAiLCJzdWJuZXRfaWQiOiIvc3Vic2NyaXB0aW9ucy84Y2JjNmYzNi03YzU2LTQ5NjMtOWQzNi03MzlkYjVkMDBiMjcvcmVzb3VyY2VHcm91cHMvY2Z0LXByb2QtbmV0d29yay1yZy9wcm92aWRlcnMvTWljcm9zb2Z0Lk5ldHdvcmsvdmlydHVhbE5ldHdvcmtzL2NmdC1wcm9kLXZuZXQvc3VibmV0cy9ha3MtMDAifSx7InJ1bGVfbmFtZSI6ImNmdC10Zi1ha3MwMSIsInN1Ym5ldF9pZCI6Ii9zdWJzY3JpcHRpb25zLzhjYmM2ZjM2LTdjNTYtNDk2My05ZDM2LTczOWRiNWQwMGIyNy9yZXNvdXJjZUdyb3Vwcy9jZnQtcHJvZC1uZXR3b3JrLXJnL3Byb3ZpZGVycy9NaWNyb3NvZnQuTmV0d29yay92aXJ0dWFsTmV0d29ya3MvY2Z0LXByb2Qtdm5ldC9zdWJuZXRzL2Frcy0wMSJ9LHsicnVsZV9uYW1lIjoiamVua2lucy1ha3MiLCJzdWJuZXRfaWQiOiIvc3Vic2NyaXB0aW9ucy8xYmFmNTQ3MC0xYzNlLTQwZDMtYTZmNy03NGJmYmNlNGIzNDgvcmVzb3VyY2VHcm91cHMvY2Z0LXB0bC1uZXR3b3JrLXJnL3Byb3ZpZGVycy9NaWNyb3NvZnQuTmV0d29yay92aXJ0dWFsTmV0d29ya3MvY2Z0LXB0bC12bmV0L3N1Ym5ldHMvaWFhcyJ9LHsicnVsZV9uYW1lIjoiamVua2lucy1ha3MtYWdlbnQiLCJzdWJuZXRfaWQiOiIvc3Vic2NyaXB0aW9ucy8xYmFmNTQ3MC0xYzNlLTQwZDMtYTZmNy03NGJmYmNlNGIzNDgvcmVzb3VyY2VHcm91cHMvY2Z0LXB0bC1uZXR3b3JrLXJnL3Byb3ZpZGVycy9NaWNyb3NvZnQuTmV0d29yay92aXJ0dWFsTmV0d29ya3MvY2Z0LXB0bC12bmV0L3N1Ym5ldHMvYWtzLTAwIn0seyJydWxlX25hbWUiOiJpZGFtLXByb2QyLXZuZXQiLCJzdWJuZXRfaWQiOiIvc3Vic2NyaXB0aW9ucy84OTk5ZGVjMy0wMTA0LTRhMjctOTRlZS02NTg4NTU5NzI5ZDEvcmVzb3VyY2VHcm91cHMvY29yZS1pbmZyYS1pZGFtLXByb2QyL3Byb3ZpZGVycy9NaWNyb3NvZnQuTmV0d29yay92aXJ0dWFsTmV0d29ya3MvY29yZS1pbmZyYS12bmV0LWlkYW0tcHJvZDIvc3VibmV0cy9jb3JlLWluZnJhLXN1Ym5ldC03LWlkYW0tcHJvZDIifSx7InJ1bGVfbmFtZSI6ImJhc3Rpb24tcHJvZC12bmV0Iiwic3VibmV0X2lkIjoiL3N1YnNjcmlwdGlvbnMvMmIxYWZjMTktNWNhOS00Nzk2LWE1NmYtNTc0YTU4NjcwMjQ0L3Jlc291cmNlR3JvdXBzL2Jhc3Rpb24tcHJvZC1yZy9wcm92aWRlcnMvTWljcm9zb2Z0Lk5ldHdvcmsvdmlydHVhbE5ldHdvcmtzL2Jhc3Rpb24tcHJvZC12bmV0L3N1Ym5ldHMvYmFzdGlvbiJ9LHsicnVsZV9uYW1lIjoic2hhcmVkLXNlcnZpY2VzLXByb2QtYWtzMDAiLCJzdWJuZXRfaWQiOiIvc3Vic2NyaXB0aW9ucy81Y2E2MjAyMi02YWEyLTRjZWUtYWFhNy1lNzUzNmM4ZDU2NmMvcmVzb3VyY2VHcm91cHMvc3MtcHJvZC1uZXR3b3JrLXJnL3Byb3ZpZGVycy9NaWNyb3NvZnQuTmV0d29yay92aXJ0dWFsTmV0d29ya3Mvc3MtcHJvZC12bmV0L3N1Ym5ldHMvYWtzLTAwIn0seyJydWxlX25hbWUiOiJzaGFyZWQtc2VydmljZXMtcHJvZC1ha3MwMSIsInN1Ym5ldF9pZCI6Ii9zdWJzY3JpcHRpb25zLzVjYTYyMDIyLTZhYTItNGNlZS1hYWE3LWU3NTM2YzhkNTY2Yy9yZXNvdXJjZUdyb3Vwcy9zcy1wcm9kLW5ldHdvcmstcmcvcHJvdmlkZXJzL01pY3Jvc29mdC5OZXR3b3JrL3ZpcnR1YWxOZXR3b3Jrcy9zcy1wcm9kLXZuZXQvc3VibmV0cy9ha3MtMDEifSx7InJ1bGVfbmFtZSI6InNoYXJlZC1kYXRhLWdhdGV3YXktcHJvZCIsInN1Ym5ldF9pZCI6Ii9zdWJzY3JpcHRpb25zLzA5NzgzMTVjLTc1ZmUtNGFkYS05ZDExLTFlYjVlMGUwYjIxNC9yZXNvdXJjZUdyb3Vwcy9obWN0cy1odWItcHJvZC1pbnQvcHJvdmlkZXJzL01pY3Jvc29mdC5OZXR3b3JrL3ZpcnR1YWxOZXR3b3Jrcy9obWN0cy1odWItcHJvZC1pbnQvc3VibmV0cy9zaGFyZWQtZGF0YS1nYXRld2F5In1d"
          - "env"                        = "prod"
          - "geoRedundantBackup"         = "Enabled"
          - "location"                   = "UK South"
          - "serverName"                 = "bulk-scan-processor-staging-prod"
          - "skuCapacity"                = "2"
          - "skuName"                    = "GP_Gen5_2"
          - "skuSizeMB"                  = "51200"
          - "skuTier"                    = "GeneralPurpose"
          - "sslEnforcement"             = "Enabled"
          - "version"                    = "11"
        } -> null
      - resource_group_name = "bulk-scan-processor-staging-data-prod" -> null
      - template_body       = jsonencode(
            {
              - "$schema"      = "http://schema.management.azure.com/schemas/2014-04-01-preview/deploymentTemplate.json#"
              - contentVersion = "1.0.0.0"
              - parameters     = {
                  - administratorLogin         = {
                      - maxLength = 16
                      - minLength = 1
                      - type      = "string"
                    }
                  - administratorLoginPassword = {
                      - type = "securestring"
                    }
                  - backupRetentionDays        = {
                      - defaultValue = 7
                      - type         = "string"
                    }
                  - charset                    = {
                      - type = "string"
                    }
                  - collation                  = {
                      - type = "string"
                    }
                  - commonTags                 = {
                      - type = "string"
                    }
                  - dbName                     = {
                      - type = "string"
                    }
                  - dbRules                    = {
                      - type = "string"
                    }
                  - env                        = {
                      - metadata = {
                          - description = "The tag"
                        }
                      - type     = "string"
                    }
                  - geoRedundantBackup         = {
                      - defaultValue = "Enabled"
                      - type         = "string"
                    }
                  - location                   = {
                      - allowedValues = [
                          - "UK West",
                          - "ukwest",
                          - "UK South",
                          - "uksouth",
                        ]
                      - defaultValue  = "UK South"
                      - type          = "string"
                    }
                  - serverName                 = {
                      - maxLength = 63
                      - minLength = 2
                      - type      = "string"
                    }
                  - skuCapacity                = {
                      - defaultValue = 2
                      - type         = "string"
                    }
                  - skuFamily                  = {
                      - allowedValues = [
                          - "Gen5",
                        ]
                      - defaultValue  = "Gen5"
                      - type          = "string"
                    }
                  - skuName                    = {
                      - allowedValues = [
                          - "B_Gen5_1",
                          - "B_Gen5_2",
                          - "GP_Gen5_2",
                          - "GP_Gen5_4",
                          - "GP_Gen5_8",
                          - "GP_Gen5_16",
                          - "GP_Gen5_32",
                          - "MO_Gen5_2",
                          - "MO_Gen5_4",
                          - "MO_Gen5_8",
                          - "MO_Gen5_16",
                          - "MO_Gen5_32",
                        ]
                      - defaultValue  = "GP_Gen5_2"
                      - type          = "string"
                    }
                  - skuSizeMB                  = {
                      - defaultValue = "51200"
                      - type         = "string"
                    }
                  - skuTier                    = {
                      - allowedValues = [
                          - "Basic",
                          - "GeneralPurpose",
                          - "MemoryOptimized",
                        ]
                      - defaultValue  = "GeneralPurpose"
                      - type          = "string"
                    }
                  - sslEnforcement             = {
                      - defaultValue = "Enabled"
                      - type         = "string"
                    }
                  - version                    = {
                      - allowedValues = [
                          - "9.5",
                          - "9.6",
                          - "10",
                          - "11",
                        ]
                      - defaultValue  = "9.6"
                      - type          = "string"
                    }
                }
              - resources      = [
                  - {
                      - apiVersion = "2017-12-01-preview"
                      - kind       = ""
                      - location   = "[parameters('location')]"
                      - name       = "[parameters('serverName')]"
                      - properties = {
                          - administratorLogin         = "[parameters('administratorLogin')]"
                          - administratorLoginPassword = "[parameters('administratorLoginPassword')]"
                          - sslEnforcement             = "[parameters('sslEnforcement')]"
                          - storageProfile             = {
                              - backupRetentionDays = "[int(parameters('backupRetentionDays'))]"
                              - geoRedundantBackup  = "[parameters('geoRedundantBackup')]"
                              - storageMB           = "[parameters('skuSizeMB')]"
                            }
                          - version                    = "[parameters('version')]"
                        }
                      - resources  = [
                          - {
                              - apiVersion = "2017-12-01-preview"
                              - dependsOn  = [
                                  - "[concat('Microsoft.DBforPostgreSQL/servers/', parameters('serverName'))]",
                                ]
                              - name       = "[parameters('dbName')]"
                              - properties = {
                                  - charset   = "[parameters('charset')]"
                                  - collation = "[parameters('collation')]"
                                }
                              - type       = "databases"
                            },
                        ]
                      - sku        = {
                          - capacity = "[parameters('skuCapacity')]"
                          - family   = "[parameters('skuFamily')]"
                          - name     = "[parameters('skuName')]"
                          - size     = "[parameters('skuSizeMB')]"
                          - tier     = "[parameters('skuTier')]"
                        }
                      - tags       = "[variables('tags')]"
                      - type       = "Microsoft.DBforPostgreSQL/servers"
                    },
                  - {
                      - apiVersion = "2017-12-01-preview"
                      - copy       = {
                          - count = "[length(variables('dbRules'))]"
                          - name  = "storagecopy"
                        }
                      - dependsOn  = [
                          - "[concat('Microsoft.DBforPostgreSQL/servers/', parameters('serverName'))]",
                        ]
                      - location   = "[parameters('location')]"
                      - name       = "[concat(parameters('serverName'), '/', variables('dbRules')[copyIndex()].rule_name)]"
                      - properties = {
                          - ignoreMissingVnetServiceEndpoint = true
                          - virtualNetworkSubnetId           = "[variables('dbRules')[copyIndex()].subnet_id]"
                        }
                      - type       = "Microsoft.DBforPostgreSQL/servers/virtualNetworkRules"
                    },
                ]
              - variables      = {
                  - dbRules = "[base64ToJson(parameters('dbRules'))]"
                  - tags    = "[base64ToJson(parameters('commonTags'))]"
                }
            }
        ) -> null
    }

  # module.bulk-scan-staging-db.null_resource.set-user-permissions[0] will be destroyed
  # (because null_resource.set-user-permissions is not in configuration)
  - resource "null_resource" "set-user-permissions" {
      - id       = "7928003981094064885" -> null
      - triggers = {
          - "db_reader_user" = "DTS JIT Access bulk-scan DB Reader SC"
          - "name"           = "bulk-scan-processor-staging"
          - "script_hash"    = "03f79db43eea0260e31fe3dc6925df25b0373bdeb9982b92bedf86dfd47d593a"
        } -> null
    }

  # module.bulk-scan-staging-db.null_resource.subnet_mappings[0] will be destroyed
  # (because null_resource.subnet_mappings is not in configuration)
  - resource "null_resource" "subnet_mappings" {
      - id       = "3666349006638593282" -> null
      - triggers = {
          - "rule_name" = "ase"
          - "subnet_id" = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/core-infra-prod/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-prod/subnets/core-infra-subnet-3-prod"
        } -> null
    }

  # module.bulk-scan-staging-db.null_resource.subnet_mappings[1] will be destroyed
  # (because null_resource.subnet_mappings is not in configuration)
  - resource "null_resource" "subnet_mappings" {
      - id       = "726722026142827292" -> null
      - triggers = {
          - "rule_name" = "cft-tf-aks00"
          - "subnet_id" = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/virtualNetworks/cft-prod-vnet/subnets/aks-00"
        } -> null
    }

  # module.bulk-scan-staging-db.null_resource.subnet_mappings[2] will be destroyed
  # (because null_resource.subnet_mappings is not in configuration)
  - resource "null_resource" "subnet_mappings" {
      - id       = "255228321982003434" -> null
      - triggers = {
          - "rule_name" = "cft-tf-aks01"
          - "subnet_id" = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/virtualNetworks/cft-prod-vnet/subnets/aks-01"
        } -> null
    }

  # module.bulk-scan-staging-db.null_resource.subnet_mappings[3] will be destroyed
  # (because null_resource.subnet_mappings is not in configuration)
  - resource "null_resource" "subnet_mappings" {
      - id       = "6151144729202542012" -> null
      - triggers = {
          - "rule_name" = "jenkins-aks"
          - "subnet_id" = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/cft-ptl-network-rg/providers/Microsoft.Network/virtualNetworks/cft-ptl-vnet/subnets/iaas"
        } -> null
    }

  # module.bulk-scan-staging-db.null_resource.subnet_mappings[4] will be destroyed
  # (because null_resource.subnet_mappings is not in configuration)
  - resource "null_resource" "subnet_mappings" {
      - id       = "4250613235283956906" -> null
      - triggers = {
          - "rule_name" = "jenkins-aks-agent"
          - "subnet_id" = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/cft-ptl-network-rg/providers/Microsoft.Network/virtualNetworks/cft-ptl-vnet/subnets/aks-00"
        } -> null
    }

  # module.bulk-scan-staging-db.null_resource.subnet_mappings[5] will be destroyed
  # (because null_resource.subnet_mappings is not in configuration)
  - resource "null_resource" "subnet_mappings" {
      - id       = "2215013569556923406" -> null
      - triggers = {
          - "rule_name" = "idam-prod2-vnet"
          - "subnet_id" = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/core-infra-idam-prod2/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-idam-prod2/subnets/core-infra-subnet-7-idam-prod2"
        } -> null
    }

  # module.bulk-scan-staging-db.null_resource.subnet_mappings[6] will be destroyed
  # (because null_resource.subnet_mappings is not in configuration)
  - resource "null_resource" "subnet_mappings" {
      - id       = "8554107537807257144" -> null
      - triggers = {
          - "rule_name" = "bastion-prod-vnet"
          - "subnet_id" = "/subscriptions/2b1afc19-5ca9-4796-a56f-574a58670244/resourceGroups/bastion-prod-rg/providers/Microsoft.Network/virtualNetworks/bastion-prod-vnet/subnets/bastion"
        } -> null
    }

  # module.bulk-scan-staging-db.null_resource.subnet_mappings[7] will be destroyed
  # (because null_resource.subnet_mappings is not in configuration)
  - resource "null_resource" "subnet_mappings" {
      - id       = "5946473106488970012" -> null
      - triggers = {
          - "rule_name" = "shared-services-prod-aks00"
          - "subnet_id" = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/ss-prod-network-rg/providers/Microsoft.Network/virtualNetworks/ss-prod-vnet/subnets/aks-00"
        } -> null
    }

  # module.bulk-scan-staging-db.null_resource.subnet_mappings[8] will be destroyed
  # (because null_resource.subnet_mappings is not in configuration)
  - resource "null_resource" "subnet_mappings" {
      - id       = "9188115998644258797" -> null
      - triggers = {
          - "rule_name" = "shared-services-prod-aks01"
          - "subnet_id" = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/ss-prod-network-rg/providers/Microsoft.Network/virtualNetworks/ss-prod-vnet/subnets/aks-01"
        } -> null
    }

  # module.bulk-scan-staging-db.null_resource.subnet_mappings[9] will be destroyed
  # (because null_resource.subnet_mappings is not in configuration)
  - resource "null_resource" "subnet_mappings" {
      - id       = "4084135933320397235" -> null
      - triggers = {
          - "rule_name" = "shared-data-gateway-prod"
          - "subnet_id" = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/hmcts-hub-prod-int/providers/Microsoft.Network/virtualNetworks/hmcts-hub-prod-int/subnets/shared-data-gateway"
        } -> null
    }

  # module.bulk-scan-staging-db.random_string.password will be destroyed
  # (because random_string.password is not in configuration)
  - resource "random_string" "password" {
      - id          = "i2x8BL<@EW5g#V56" -> null
      - length      = 16 -> null
      - lower       = true -> null
      - min_lower   = 0 -> null
      - min_numeric = 0 -> null
      - min_special = 0 -> null
      - min_upper   = 0 -> null
      - number      = true -> null
      - numeric     = true -> null
      - result      = "i2x8BL<@EW5g#V56" -> null
      - special     = true -> null
      - upper       = true -> null
    }

Plan: 5 to add, 5 to change, 33 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":3264,"Program":"tfcmt","SHA1":"","Target":"prod","Vars":{}} -->